<a href="https://colab.research.google.com/github/vard-uhi/Yerevan-Apartment-Price-Prediction/blob/master/Data_Cleaning_Yerevan_Apartment_Price.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Data Cleaning**

In [1]:
#data manipulation, transformation
import pandas as pd

In [2]:
#load the data
from google.colab import files
data_to_load = files.upload()

Saving Yerevan_apartment_primary_data.csv to Yerevan_apartment_primary_data.csv

In [3]:
import io
# .read_csv() assigns the information from the initial *.csv file to this variable
raw_data = pd.read_csv(io.BytesIO(data_to_load['Yerevan_apartment_primary_data.csv']))

In [4]:
df = raw_data.copy()

***Checking the content of the dataset***

In [5]:
df.head()

                                           title  ... balcony_type
0       For sale Apartment on Artsakh in Erebuni  ...        Large
1      For sale Apartment on Jrashat in Downtown  ...        Large
2  For sale Apartment on Y.Koghbatsi in Downtown  ...        Large
3   For sale Apartment on Khorenatsi in Downtown  ...       Lodgia
4      For sale Apartment on Lvovyan in Nor Nork  ...        Large

[5 rows x 9 columns]

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2069 entries, 0 to 2068
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2069 non-null   object
 1   price          2069 non-null   object
 2   currency       2069 non-null   object
 3   total_area     2069 non-null   object
 4   room_count     2069 non-null   object
 5   flour          2069 non-null   object
 6   condition      2069 non-null   object
 7   building_type  2069 non-null   object
 8   balcony_type   2069 non-null   object
dtypes: object(9)
memory usage: 145.6+ KB

***Summary of the DataFrame***

Our DataFrame consists of 9 columns and 2069 rows.
 
We have numeric and categorical data. However in the dataframe, all features have object type. We need to convert them into appropriate data types.
 
Columns contain additional info, that is why our next step will be to split columns and extract relevant data.
 
WE don't have missing values.

We see that 'flour' column name is misspelled, we will fix it at the end of this exercise.

***Data Cleaning***

***'title' column***

As we saw from previou of data, 'title' contains 2 important information, street and district of the apartment. In order to avoid multicollinearity in a further analysis we will extract only 'District' information and will make data type as string.

In [7]:
#checking data type of the first element
type(df['title'][0])

str

In [8]:
#creating 'District' column from 'title'
df['District'] = df['title'].str.split().str[-1]

In [10]:
df.groupby(['District']).count()

                  title  price  ...  building_type  balcony_type
District                        ...
Ajapnyak             83     83  ...             83            83
Arabkir             675    675  ...            675           675
Avan                 21     21  ...             21            21
Davtashen            80     80  ...             80            80
Downtown            735    735  ...            735           735
Erebuni              27     27  ...             27            27
Kanaker-Zeitun      199    199  ...            199           199
Malatia-Sebastia     42     42  ...             42            42
Nork                106    106  ...            106           106
Nork-Marash          17     17  ...             17            17
Nubarashen            1      1  ...              1             1
Shengavit            61     61  ...             61            61
in                    1      1  ...              1             1
region               21     21  ...             21            21

[14 rows x 9 columns]

In [13]:
pd.options.display.max_columns = None
pd.options.display.max_rows = None

In [ ]:
df.head(1000)

In [11]:
df['District'].unique()

array(['Erebuni', 'Downtown', 'Nork', 'Davtashen', 'Ajapnyak', 'Avan',
       'Arabkir', 'Shengavit', 'Kanaker-Zeitun', 'Malatia-Sebastia',
       'region', 'in', 'Nork-Marash', 'Nubarashen'], dtype=object)

After exploring the dataset, I understood that 'in' unique value in 'District' is because our raw data also contains some data on apartments that are located in Regions of Armenia. We need to deal with it, to have only Yerevan apartments in our dataset.

In [15]:
indexNames = df[(df['District'] == 'region')].index

In [16]:
df.drop(indexNames, inplace=True)

In [17]:
df['District'].unique()

array(['Erebuni', 'Downtown', 'Nork', 'Davtashen', 'Ajapnyak', 'Avan',
       'Arabkir', 'Shengavit', 'Kanaker-Zeitun', 'Malatia-Sebastia', 'in',
       'Nork-Marash', 'Nubarashen'], dtype=object)

In [18]:
indexNames2 = df[(df['District'] == 'in')].index

In [19]:
df.drop(indexNames2 , inplace=True)

In [20]:
df['District'].unique()

array(['Erebuni', 'Downtown', 'Nork', 'Davtashen', 'Ajapnyak', 'Avan',
       'Arabkir', 'Shengavit', 'Kanaker-Zeitun', 'Malatia-Sebastia',
       'Nork-Marash', 'Nubarashen'], dtype=object)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2047 entries, 0 to 2068
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2047 non-null   object
 1   price          2047 non-null   object
 2   currency       2047 non-null   object
 3   total_area     2047 non-null   object
 4   room_count     2047 non-null   object
 5   flour          2047 non-null   object
 6   condition      2047 non-null   object
 7   building_type  2047 non-null   object
 8   balcony_type   2047 non-null   object
 9   District       2047 non-null   object
dtypes: object(10)
memory usage: 175.9+ KB

In [22]:
df = df.reset_index(drop=True)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2047 entries, 0 to 2046
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2047 non-null   object
 1   price          2047 non-null   object
 2   currency       2047 non-null   object
 3   total_area     2047 non-null   object
 4   room_count     2047 non-null   object
 5   flour          2047 non-null   object
 6   condition      2047 non-null   object
 7   building_type  2047 non-null   object
 8   balcony_type   2047 non-null   object
 9   District       2047 non-null   object
dtypes: object(10)
memory usage: 160.0+ KB

In [24]:
type(['District'][0])

str

Splitting was successful, we can drop 'title' column.

In [25]:
df = df.drop(['title'], axis=1)

In [26]:
df.head()

,price,currency,total_area,room_count,flour,condition,building_type,balcony_type,District
0,"52,000",USD,66 m2,Count of rooms 2,Floor 4,repair,"['type', 'High-rise']",Large,Erebuni
1,"130,000",USD,90 m2,Count of rooms 3,Floor 2,repair,"['type', 'Stone']",Large,Downtown
2,"80,000",USD,42 m2,Count of rooms 1,Floor 3,Repairing,"['type', 'High-rise']",Large,Downtown
3,"55,000",USD,37 m2,Count of rooms 1,Floor 9,3-5y,"['type', 'High-rise']",Lodgia,Downtown
4,"47,000",USD,63 m2,Count of rooms 2,Floor 8,repair,"['type', 'High-rise']",Large,Nork

***'price' column***

In [27]:
 #gerring rid of ','
 df['Price'] = df['price'].astype(str).str.replace(',', '', regex=False)

In [28]:
type(df['Price'][0])

str

In [29]:
df['Price'] = pd.to_numeric(df['Price'])

In [30]:
type(df['Price'][0])

numpy.int64

In [31]:
df = df.drop(['price'], axis=1)

In [32]:
df.head()

,currency,total_area,room_count,flour,condition,building_type,balcony_type,District,Price
0,USD,66 m2,Count of rooms 2,Floor 4,repair,"['type', 'High-rise']",Large,Erebuni,52000
1,USD,90 m2,Count of rooms 3,Floor 2,repair,"['type', 'Stone']",Large,Downtown,130000
2,USD,42 m2,Count of rooms 1,Floor 3,Repairing,"['type', 'High-rise']",Large,Downtown,80000
3,USD,37 m2,Count of rooms 1,Floor 9,3-5y,"['type', 'High-rise']",Lodgia,Downtown,55000
4,USD,63 m2,Count of rooms 2,Floor 8,repair,"['type', 'High-rise']",Large,Nork,47000

***'currency' column***

In [33]:
df['currency'].nunique()

1

As we see, currency has only one value USD. Henc, we can drop it.

In [34]:
#drop
df = df.drop(['currency'], axis=1)

***'total_area'*** column

In [35]:
type(df['total_area'][0])

str

In [36]:
df['Total Area(m2)'] = df['total_area'].str.split().str[0]

In [37]:
df.head()

,total_area,room_count,flour,condition,building_type,balcony_type,District,Price,Total Area(m2)
0,66 m2,Count of rooms 2,Floor 4,repair,"['type', 'High-rise']",Large,Erebuni,52000,66
1,90 m2,Count of rooms 3,Floor 2,repair,"['type', 'Stone']",Large,Downtown,130000,90
2,42 m2,Count of rooms 1,Floor 3,Repairing,"['type', 'High-rise']",Large,Downtown,80000,42
3,37 m2,Count of rooms 1,Floor 9,3-5y,"['type', 'High-rise']",Lodgia,Downtown,55000,37
4,63 m2,Count of rooms 2,Floor 8,repair,"['type', 'High-rise']",Large,Nork,47000,63

In [38]:
type(df['Total Area(m2)'][0])

str

In [39]:
#chanching data type to numeric
df['Total Area(m2)'] = pd.to_numeric(df['Total Area(m2)'])

In [40]:
type(df['Total Area(m2)'][0])

numpy.int64

In [41]:
df = df.drop(['total_area'], axis=1)

In [42]:
df.head()

,room_count,flour,condition,building_type,balcony_type,District,Price,Total Area(m2)
0,Count of rooms 2,Floor 4,repair,"['type', 'High-rise']",Large,Erebuni,52000,66
1,Count of rooms 3,Floor 2,repair,"['type', 'Stone']",Large,Downtown,130000,90
2,Count of rooms 1,Floor 3,Repairing,"['type', 'High-rise']",Large,Downtown,80000,42
3,Count of rooms 1,Floor 9,3-5y,"['type', 'High-rise']",Lodgia,Downtown,55000,37
4,Count of rooms 2,Floor 8,repair,"['type', 'High-rise']",Large,Nork,47000,63

***'room_count' column***

In [43]:
type(df['room_count'][0])

str

In [44]:
df['Room Count'] = df['room_count'].str.split().str[-1]

In [45]:
df.head()

,room_count,flour,condition,building_type,balcony_type,District,Price,Total Area(m2),Room Count
0,Count of rooms 2,Floor 4,repair,"['type', 'High-rise']",Large,Erebuni,52000,66,2
1,Count of rooms 3,Floor 2,repair,"['type', 'Stone']",Large,Downtown,130000,90,3
2,Count of rooms 1,Floor 3,Repairing,"['type', 'High-rise']",Large,Downtown,80000,42,1
3,Count of rooms 1,Floor 9,3-5y,"['type', 'High-rise']",Lodgia,Downtown,55000,37,1
4,Count of rooms 2,Floor 8,repair,"['type', 'High-rise']",Large,Nork,47000,63,2

In [46]:
df['Room Count'] = pd.to_numeric(df['Room Count'])

In [47]:
type(df['Room Count'][0])

numpy.int64

In [48]:
df = df.drop(['room_count'], axis=1)

In [49]:
df.head()

,flour,condition,building_type,balcony_type,District,Price,Total Area(m2),Room Count
0,Floor 4,repair,"['type', 'High-rise']",Large,Erebuni,52000,66,2
1,Floor 2,repair,"['type', 'Stone']",Large,Downtown,130000,90,3
2,Floor 3,Repairing,"['type', 'High-rise']",Large,Downtown,80000,42,1
3,Floor 9,3-5y,"['type', 'High-rise']",Lodgia,Downtown,55000,37,1
4,Floor 8,repair,"['type', 'High-rise']",Large,Nork,47000,63,2

***'floor' column***

In [50]:
type(df['flour'][0])

str

In [51]:
df['Floor'] = df['flour'].str.split().str[-1]

In [52]:
df.head()

,flour,condition,building_type,balcony_type,District,Price,Total Area(m2),Room Count,Floor
0,Floor 4,repair,"['type', 'High-rise']",Large,Erebuni,52000,66,2,4
1,Floor 2,repair,"['type', 'Stone']",Large,Downtown,130000,90,3,2
2,Floor 3,Repairing,"['type', 'High-rise']",Large,Downtown,80000,42,1,3
3,Floor 9,3-5y,"['type', 'High-rise']",Lodgia,Downtown,55000,37,1,9
4,Floor 8,repair,"['type', 'High-rise']",Large,Nork,47000,63,2,8

In [53]:
df['Floor'] = pd.to_numeric(df['Floor'])

ValueError: ignored

In [55]:
df['Floor'].unique()

array(['4', '2', '3', '9', '8', '5', 'Б', '1', '6', '7', '11', '13', '14',
       '15', '2,3', '10', '16', '17', '18', '12', '4,5', 'М,4', '5,6',
       'Н,5', 'М,5', 'М,3', 'Н,4', 'Н', '10,11', 'М', '1,2', 'Б,П',
       'Б,Пп', 'Н,9', '12,13', '16,17', 'Н,М', '5,6,7', 'М,9', 'Н,3',
       'М,6', 'П,1', '8,9', 'Н,3,4', 'Пп', '1,2,3', 'М,8', '15,16',
       'Н,М,4', 'Н,4,5', 'М,П,2', 'Пп,1', 'М,2', 'М,10', 'Н,2', '14,15',
       '3,4', '15,16,17', 'М,4,5', 'М,7', '13,14,15'], dtype=object)

In [56]:
df.groupby(['Floor']).count()

,flour,condition,building_type,balcony_type,District,Price,Total Area(m2),Room Count
Floor,,,,,,,,
1,124,124,124,124,124,124,124,124
"1,2",3,3,3,3,3,3,3,3
"1,2,3",1,1,1,1,1,1,1,1
10,42,42,42,42,42,42,42,42
"10,11",2,2,2,2,2,2,2,2
11,49,49,49,49,49,49,49,49
12,36,36,36,36,36,36,36,36
"12,13",2,2,2,2,2,2,2,2
13,48,48,48,48,48,48,48,48
"13,14,15",1,1,1,1,1,1,1,1
14,26,26,26,26,26,26,26,26
"14,15",1,1,1,1,1,1,1,1
15,17,17,17,17,17,17,17,17
"15,16",1,1,1,1,1,1,1,1
"15,16,17",1,1,1,1,1,1,1,1
16,10,10,10,10,10,10,10,10
"16,17",3,3,3,3,3,3,3,3
17,6,6,6,6,6,6,6,6
18,3,3,3,3,3,3,3,3
2,245,245,245,245,245,245,245,245
"2,3",2,2,2,2,2,2,2,2
3,246,246,246,246,246,246,246,246
"3,4",2,2,2,2,2,2,2,2
4,308,308,308,308,308,308,308,308
"4,5",6,6,6,6,6,6,6,6
5,276,276,276,276,276,276,276,276
"5,6",5,5,5,5,5,5,5,5
"5,6,7",1,1,1,1,1,1,1,1
6,100,100,100,100,100,100,100,100
7,89,89,89,89,89,89,89,89
8,89,89,89,89,89,89,89,89
"8,9",1,1,1,1,1,1,1,1
9,84,84,84,84,84,84,84,84
Б,92,92,92,92,92,92,92,92
"Б,П",2,2,2,2,2,2,2,2
"Б,Пп",5,5,5,5,5,5,5,5
М,10,10,10,10,10,10,10,10
"М,10",1,1,1,1,1,1,1,1
"М,2",4,4,4,4,4,4,4,4
"М,3",4,4,4,4,4,4,4,4
"М,4",16,16,16,16,16,16,16,16
"М,4,5",1,1,1,1,1,1,1,1
"М,5",9,9,9,9,9,9,9,9
"М,6",6,6,6,6,6,6,6,6
"М,7",1,1,1,1,1,1,1,1
"М,8",2,2,2,2,2,2,2,2
"М,9",3,3,3,3,3,3,3,3
"М,П,2",2,2,2,2,2,2,2,2
Н,18,18,18,18,18,18,18,18
"Н,2",1,1,1,1,1,1,1,1
"Н,3",2,2,2,2,2,2,2,2
"Н,3,4",2,2,2,2,2,2,2,2
"Н,4",10,10,10,10,10,10,10,10
"Н,4,5",1,1,1,1,1,1,1,1
"Н,5",6,6,6,6,6,6,6,6
"Н,9",3,3,3,3,3,3,3,3
"Н,М",4,4,4,4,4,4,4,4
"Н,М,4",1,1,1,1,1,1,1,1
"П,1",5,5,5,5,5,5,5,5
Пп,3,3,3,3,3,3,3,3
"Пп,1",3,3,3,3,3,3,3,3

In order to understand the meaning of this Russion letters under the Floor column I revisited the website from which I have scraped this data.

There are basement or roof top and other types of floores that have specific names and they aren't considered as a regular floor. Also we have large apartments which have several floors. 

I will replace this letter values with appropriate numerical values and, for several floor apartments we will keep the mean of those floors.

In [58]:
new_values = {'4':'4', '2':'2', '3':'3', '9':'9', '8':'8', 
              '5':'5', 'Б':'1', '1':'1', '6':'6',
              '7':'7', '11':'11', '13':'13', '14':'14',
              '15':'15', '2,3':'3', '10':'10', '16':'16', 
              '17':'17', '18':'18', '12':'12', '4,5':'5', 'М,4':'4',
              '5,6':'6', 'Н,5':'5', 'М,5':'5', 'М,3':'3', 'Н,4':'4', 'Н':'4', 
              '10,11':'11', 'М':'4', '1,2':'2', 'Б,П':'0',
              'Б,Пп':'0', 'Н,9':'9', '12,13':'13', '16,17':'17', 'Н,М':'5',
              '5,6,7':'6', 'М,9':'9', 'Н,3':'3', 'М,6':'6', 'П,1':'1', '8,9':'9', 
              'Н,3,4':'3', 'Пп':'0', '1,2,3':'2', 'М,8':'8', '15,16':'16',
              'Н,М,4':'4', 'Н,4,5':'4', 'М,П,2':'2', 'Пп,1':'1', 'М,2':'2', 
              'М,10':'10', 'Н,2':'2', '14,15':'15', '3,4':'4', '15,16,17':'16',
              'М,4,5':'4', 'М,7':'7', '13,14,15':'14'}
    
df['Floor'] = df['Floor'].map(new_values)

In [59]:
df['Floor'].unique()

array(['4', '2', '3', '9', '8', '5', '1', '6', '7', '11', '13', '14',
       '15', '10', '16', '17', '18', '12', '0'], dtype=object)

In [60]:
df['Floor'] = pd.to_numeric(df['Floor'])

In [61]:
type(df['Floor'][0])

numpy.int64

In [62]:
df = df.drop(['flour'], axis=1)

In [63]:
df.head()

,condition,building_type,balcony_type,District,Price,Total Area(m2),Room Count,Floor
0,repair,"['type', 'High-rise']",Large,Erebuni,52000,66,2,4
1,repair,"['type', 'Stone']",Large,Downtown,130000,90,3,2
2,Repairing,"['type', 'High-rise']",Large,Downtown,80000,42,1,3
3,3-5y,"['type', 'High-rise']",Lodgia,Downtown,55000,37,1,9
4,repair,"['type', 'High-rise']",Large,Nork,47000,63,2,8

***'condition' column***

In [64]:
type(df['condition'][0])

str

In [65]:
df['condition'].nunique()

8

In [66]:
df['condition'].unique()

array(['repair', 'Repairing', '3-5y', 'Original', '2y.', 'repairs',
       'req.', 'Ruins'], dtype=object)

I displayed all the data and tried to understand 'req.' meaning, based on other conditions, just to be sure, those are old Soviet buildings which require repairing.

As we see from our unique values, Repaired condition is written in 3 different ways. To solve it we will assign the same value instead of that.

In [68]:
corrected_values = {'repair':'Repaired', 'Repairing':'Repaired', '3-5y':'3-5 Years','Original':'Original', '2y.':'2 Years', 
     'repairs':'Repaired', 'req.':'Needs Repairing', 'Ruins':'Ruins'}

df['Condition'] = df['condition'].map(corrected_values)

In [69]:
df.head()

,condition,building_type,balcony_type,District,Price,Total Area(m2),Room Count,Floor,Condition
0,repair,"['type', 'High-rise']",Large,Erebuni,52000,66,2,4,Repaired
1,repair,"['type', 'Stone']",Large,Downtown,130000,90,3,2,Repaired
2,Repairing,"['type', 'High-rise']",Large,Downtown,80000,42,1,3,Repaired
3,3-5y,"['type', 'High-rise']",Lodgia,Downtown,55000,37,1,9,3-5 Years
4,repair,"['type', 'High-rise']",Large,Nork,47000,63,2,8,Repaired

In [70]:
df['Condition'].unique()

array(['Repaired', '3-5 Years', 'Original', '2 Years', 'Needs Repairing',
       'Ruins'], dtype=object)

In [71]:
df['Condition'].nunique()

6

In [72]:
df = df.drop(['condition'], axis=1)

***'building_type'*** column

In [73]:
type(df['building_type'][0])

str

In [74]:
df['building_type'].unique()

array(["['type', 'High-rise']", "['type', 'Stone']",
       "['type', 'Khrushchev(2,75м)']", "['New', 'building']",
       "['', 'b/o']", "['', 'w/o']", "['type', 'Khrushchev(2,5-2,6м)']",
       "['type', 'Panel(5f.)']", "['type', 'Casset']"], dtype=object)

In [75]:
corrected_values_building = {"['type', 'High-rise']":"High-rise", "['type', 'Stone']":"Stone", 
                             "['type', 'Khrushchev(2,75м)']":"Khrushchev(2,75м)", "['New', 'building']":"New Building",
                           "['', 'b/o']":"Stalinian", "['', 'w/o']":"Stalinian", "['type', 'Khrushchev(2,5-2,6м)']":"Khrushchev(2,5-2,6м)", 
                           "['type', 'Panel(5f.)']":"Panel(5floor)", "['type', 'Casset']":"Casset"}

df['Building Type'] = df['building_type'].map(corrected_values_building)

In [76]:
df.head()

,building_type,balcony_type,District,Price,Total Area(m2),Room Count,Floor,Condition,Building Type
0,"['type', 'High-rise']",Large,Erebuni,52000,66,2,4,Repaired,High-rise
1,"['type', 'Stone']",Large,Downtown,130000,90,3,2,Repaired,Stone
2,"['type', 'High-rise']",Large,Downtown,80000,42,1,3,Repaired,High-rise
3,"['type', 'High-rise']",Lodgia,Downtown,55000,37,1,9,3-5 Years,High-rise
4,"['type', 'High-rise']",Large,Nork,47000,63,2,8,Repaired,High-rise

In [77]:
df = df.drop(['building_type'], axis=1)

***'balcony_type'*** column

In [79]:
type(df['balcony_type'][0])

str

In [80]:
df['balcony_type'].unique()

array(['Large', 'Lodgia', 'Front', 'French'], dtype=object)

In [81]:
df.head()

,balcony_type,District,Price,Total Area(m2),Room Count,Floor,Condition,Building Type
0,Large,Erebuni,52000,66,2,4,Repaired,High-rise
1,Large,Downtown,130000,90,3,2,Repaired,Stone
2,Large,Downtown,80000,42,1,3,Repaired,High-rise
3,Lodgia,Downtown,55000,37,1,9,3-5 Years,High-rise
4,Large,Nork,47000,63,2,8,Repaired,High-rise

In [82]:
df['Balcony Type'] = df['balcony_type']

In [83]:
df = df.drop(['balcony_type'], axis=1)

***Summary***

We have cleaned our dataset and as a result we have: 4 numeric features 5 categorical features.

We will save our data on data_cleaned.csv file.

In [84]:
df.head()

,District,Price,Total Area(m2),Room Count,Floor,Condition,Building Type,Balcony Type
0,Erebuni,52000,66,2,4,Repaired,High-rise,Large
1,Downtown,130000,90,3,2,Repaired,Stone,Large
2,Downtown,80000,42,1,3,Repaired,High-rise,Large
3,Downtown,55000,37,1,9,3-5 Years,High-rise,Lodgia
4,Nork,47000,63,2,8,Repaired,High-rise,Large

In [85]:
df.columns.values

array(['District', 'Price', 'Total Area(m2)', 'Room Count', 'Floor',
       'Condition', 'Building Type', 'Balcony Type'], dtype=object)

In [86]:
cols = ['Price', 'Total Area(m2)', 'Room Count', 'Floor',
       'Condition', 'Building Type', 'Balcony Type', 'District']

In [87]:
data_cleaned = df[cols]

In [88]:
data_cleaned.head()

,Price,Total Area(m2),Room Count,Floor,Condition,Building Type,Balcony Type,District
0,52000,66,2,4,Repaired,High-rise,Large,Erebuni
1,130000,90,3,2,Repaired,Stone,Large,Downtown
2,80000,42,1,3,Repaired,High-rise,Large,Downtown
3,55000,37,1,9,3-5 Years,High-rise,Lodgia,Downtown
4,47000,63,2,8,Repaired,High-rise,Large,Nork

In [89]:
data_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2047 entries, 0 to 2046
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Price           2047 non-null   int64
 1   Total Area(m2)  2047 non-null   int64
 2   Room Count      2047 non-null   int64
 3   Floor           2047 non-null   int64
 4   Condition       2047 non-null   object
 5   Building Type   2047 non-null   object
 6   Balcony Type    2047 non-null   object
 7   District        2047 non-null   object
dtypes: int64(4), object(4)
memory usage: 128.1+ KB

In [90]:
from google.colab import files
data_cleaned.to_csv('data_cleaned.csv', index=False) 
files.download('data_cleaned.csv')